2024-fall/STEM as Christian Vocation.tex
% Created 2024-09-25 Wed 12:01
% Intended LaTeX compiler: xelatex
\documentclass[12pt]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[left=0.75in, right=0.75in, top=0.75in, bottom=0.75in]{geometry}
\usepackage{biblatex}
\addbibresource{~/org/biblio.bib}
\usepackage{mdframed}
\usepackage{titlesec}
\titleformat{\section}[block]{\Large\bfseries\filcenter}{}{1em}{}
\let\oldsection\section
\renewcommand\section{\clearpage\oldsection}
\usepackage{enumitem}
\setlist[itemize]{itemsep=1pt}
\setlist[enumerate]{itemsep=1pt}
\usepackage{mlmodern}
\usepackage{xcolor}
\usepackage{amsmath, amssymb}
\usepackage{fontspec}
\setmainfont{Linux Libertine}
\setmonofont[Mapping=tex-text]{Dank Mono}
\newcommand{\bluetext}[1]{\textcolor{blue}{#1}}
\date{}
\title{S.T.E.M. as a Christian Vocation\\\medskip
\large Fall 2024}
\hypersetup{
 pdfauthor={},
 pdftitle={S.T.E.M. as a Christian Vocation},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Introduction}
\label{sec:orgf3b89ac}
\begin{center}
\textbf{Faith and Vocation as Practitioners of Engineering, Computer Science, and
 Technology}
\end{center}

\emph{``Whether you are a student or a seasoned professional, many Christians working
in technical areas struggle with engaging their faith in the world of
technology. Perhaps you never thought about how your faith might inform your
work in technology. Perhaps you feel a disconnect between your daily
professional life and your Christian spiritual walk. The development of
technology through science and engineering has always been a cultural activity
with religious implications, but its direction is set by the human heart.
Developing and using technology is one way we love God and our neighbor, and
more fully witness to the gospel of Jesus Christ for the entire world.''}

\begin{flushright}
From \emph{A Christian Field Guide to Technology for Engineers and Designers} by
Ethan Brue, Derek Schuurman, and Steven Vanderleest
\end{flushright}

The primary question driving this discussion group is, \emph{What does it mean to
follow Christ in a technological vocation?} Modernity seems to be telling us that
science, technology, and engineering are somehow opposed to faith. Furthermore,
to many, the influence of technology and ``science'' are the primary reasons for
abandoning their faith. However, many feel called to engage with technology, not
simply as an end user, but a creator, practitioner, designer, and engineer.
\section*{Schedule Overview}
\label{sec:org557e248}
We are meeting the \textbf{\uline{First four Tuesdays of October at 6:00 PM in the Upstairs
Lounge at the CSC}}
\subsection*{Week 1, Tuesday, October 1}
\label{sec:org7e600cb}
\textbf{\uline{Subject: The Technological Frame}}
\begin{mdframed}[nobreak=true]
\emph{“Therefore everyone who hears these words of mine and puts them into practice
is like a wise man who built his house on the rock. The rain came down, the
streams rose, and the winds blew and beat against that house; yet it did not
fall, because it had its foundation on the rock. But everyone who hears these
words of mine and does not put them into practice is like a foolish man who
built his house on sand. The rain came down, the streams rose, and the winds
blew and beat against that house, and it fell with a great crash.”} Matthew
7:24-27
\end{mdframed}

Can we build our understanding of the technological vocation on rock?
\subsubsection*{Readings}
\label{sec:org928a670}
\begin{itemize}
\item \emph{What Frames What?} by Richard Horner \emph{Reconsiderations} Vol 4, \#5 October
2005
\item \emph{Five Things We Need to Know About Technological Change} by Neil Postman,
Lecture Given in March 1998
\item \emph{A Christian Field Guide to Technology for Engineers and Designers}, Chapters
2 \& 3, by Ethan Brue, Derek Schuurman, and Steven Vanderleest
\end{itemize}
\subsection*{Week 2, Tuesday, October 8}
\label{sec:org3845837}
\textbf{\uline{Subject: A Secular Framing of Ethics}}
\begin{mdframed}[nobreak=true]
\emph{``Do not love the world or anything in the world. If anyone loves the world,
love for the Father is not in them. For everything in the world—the lust
of the flesh, the lust of the eyes, and the pride of life—comes not from the
Father but from the world. The world and its desires pass away, but whoever
does the will of God lives forever.''} 1 John 2:15-17
\end{mdframed}
\subsubsection*{Readings}
\label{sec:org6f796b7}
\begin{itemize}
\item \emph{Ethics in the Age of Disruptive Technology, Appendix 1/2 - Examples of
Technology Ethics and Responsible Technology Practices \& ITEC Principles and
How to Use Them: Anchoring, Guiding, Specifying, Action} by Intstitute for
Technology, Ethics, and Culture
\item \emph{Ethics in Technology Practice} by Shannon Vallor, Iring Raicu, and Brian
Green. The Markkula Center for Applied Ethics at Santa Clara University
\item \emph{Code of Ethics for Engineers} National Society of Professional Engineers
\item \emph{EGS 4034 Syllabus - Engineering Ethics} University of Florida
\end{itemize}
\subsection*{Week 3, Tuesday, October 15}
\label{sec:org53b2277}
\textbf{\uline{Subject: A Christian Framing of Ethics}}
\begin{mdframed}[nobreak=true]
\emph{``Do not conform to the pattern of this world, but be transformed by the
renewing of your mind. Then you will be able to test and approve what God’s will
is—his good, pleasing and perfect will.''} Romans 12:2 \newline
\noindent \emph{``Your hands made me and formed me; give me understanding to
learn your commands.''} Psalm 119:73
\end{mdframed}
\subsubsection*{Readings}
\label{sec:org105be41}
\begin{itemize}
\item \emph{The Computer Scientist as Toolsmith II} by Fred Brooks, Communications with
the ACM, March 1996
\item \emph{A Christian Field Guide to Technology for Engineers and Designers}, Chapters
5 \& 6, by Ethan Brue, Derek Schuurman, and Steven Vanderleest
\end{itemize}
\subsection*{Week 4, Tuesday, October 22}
\label{sec:org54be782}
\textbf{\uline{Subject: Putting it Into Practice}}
\begin{mdframed}[nobreak=true]
\emph{``Whatever you do, work at it with all your heart, as working for the Lord, not
for human masters, since you know that you will receive an inheritance from the
Lord as a reward. It is the Lord Christ you are serving.''} Colossians 3:23-24
\end{mdframed}
\subsubsection*{Readings}
\label{sec:orgabf0597}
\begin{itemize}
\item \emph{A Christian Field Guide to Technology for Engineers and Designers}, Chapter
9, by Ethan Brue, Derek Schuurman, and Steven Vanderleest
\end{itemize}
\section*{Week 1 - October 1}
\label{sec:org830fbe1}
\begin{center}
\large \textbf{\uline{The Technological Frame}}
\end{center}
\begin{mdframed}
\emph{``I never said a word against eminent men of science. What I complain of is a
vague popular philosophy which supposes itself to be scientific when it is
really nothing but a sort of new religion and an uncommonly nasty one. When
people talked about the fall of man, they knew they were talking about a
mystery, a thing they didn’t understand. Now they talk about the survival of the
fittest: they think they do understand it, whereas they have not merely no
notion, they have an elaborately false notion of what the words mean.''}

\hfill G.K. Chesterton, \emph{The Club of Queer Trades} (1905)
\end{mdframed}
\subsection*{Readings}
\label{sec:orgd094db2}
\begin{enumerate}
\item \emph{What Frames What?} by Richard Horner
\item \emph{Five Things We Need to Know About Technological Change} by Neil Postman
\item \emph{A Christian Field Guide to Technology for Engineers and Designers}, Chapters
2 \& 3, by Ethan Brue, Derek Schuurman, and Steven Vanderleest
\end{enumerate}
\subsection*{Discussion Topics}
\label{sec:orgf1b0d07}
\begin{itemize}
\item What frame does modern society inhabit? Is it Christian? Post-Christian?
Modern? Utilitarian? Religious? Anti-religious? Technological?
\item How does our frame dictate our actions?
\item What serves what? Does technology serve us, or are we molded to serve
technology?
\item Technology as an \emph{ecological} (not \emph{additive}) change.
\end{itemize}
\section*{Week 2 - October 8}
\label{sec:org2b8bb2b}
\begin{center}
\large \textbf{\uline{A Secular Framing of Ethics}}
\end{center}
\begin{mdframed}
\emph{``Mr. Wells, however, is not quite clear enough of the narrower scientific outlook
to see that there are some things which actually ought not to be scientific. He
is still slightly affected with the great scientific fallacy; I mean the habit
of beginning not with the human soul, which is the first thing a man learns
about, but with some such thing as protoplasm, which is about the last. The one
defect in his splendid mental equipment is that he does not sufficiently allow
for the stuff or material of men. In his new Utopia he says, for instance, that
a chief point of the Utopia will be a disbelief in original sin. If he had begun
with the human soul—that is, if he had begun on himself—he would have found
original sin almost the first thing to be believed in.''}

\hfill G.K. Chesterton, \emph{Heretics} (1905)
\end{mdframed}
\subsection*{Readings}
\label{sec:org63f2c4d}
\begin{enumerate}
\item \emph{Ethics in the Age of Disruptive Technology, Appendix 1/2} by Intstitute for
Technology, Ethics, and Culture
\item \emph{Ethics in Technology Practice} by Shannon Vallorm, Iring Raicu, and Brian
Green
\item \emph{Code of Ethics for Engineers} by National Society of Professional Engineers
\item \emph{EGS 4034 Syllabus - Engineering Ethics}, University of Florida
\end{enumerate}
\subsection*{Discussion Topics}
\label{sec:orgea950e9}
\begin{itemize}
\item ITEC listed Microsoft, IBM, and Google as \emph{exemplars} of an ``ethical company''.
Do you agree? Why or why not?
\item Most modern ethical frameworks seem to revolve around
utilitarianism/consequentialism
(\url{https://plato.stanford.edu/entries/consequentialism/}). That is, actions
should be judged on their outcome, and the judging criteria is the \emph{net
good/utility/happiness} as a result. How ought a Christian think about this?
\end{itemize}
\section*{Week 3 - October 15}
\label{sec:org10b7842}
\begin{center}
\large \textbf{\uline{A Christian Framing of Ethics}}
\end{center}
\begin{mdframed}
\emph{``Modern masters of science are much impressed with the need of beginning all
inquiry with a fact. The ancient masters of religion were quite equally
impressed with that necessity. They began with the fact of sin—a fact as
practical as potatoes. Whether or not man could be washed in miraculous waters,
there was no doubt at any rate that he wanted washing.''}

\hfill G.K. Chesterton, \emph{Orthodoxy} (1908) \newline

\noindent \emph{``Christianity is an event. There is no other word to indicate its nature, neither the word
law, nor the words ideology, concept, or plan. Christianity is not a religious doctrine, a
series of moral laws or a collection of rites. Christianity is a fact, an event.''}

\hfill Luigi Giussani, \emph{Generating Traces in the History of the World} (2010)
\end{mdframed}
\subsection*{Readings}
\label{sec:org341b038}
\begin{enumerate}
\item \emph{The Computer Scientist as Toolsmith II} by Fred Brooks
\item \emph{A Christian Field Guide to Technology for Engineers and Designers}, Chapters
5 \& 6, by Ethan Brue, Derek Schuurman, and Steven Vanderleest
\item Matthew 5-7 (The Sermon on the Mount)
\end{enumerate}
\subsection*{Discussion Topics}
\label{sec:orgd328e87}
\begin{itemize}
\item The revival of virtue ethics
(\url{https://plato.stanford.edu/entries/ethics-virtue/}) in modern times has seen a
resurgence among Christian thinkers. How does this interact with technology?
\item What are the main differences between Christian ethics and secular ethics?
\end{itemize}
\section*{Week 4 - October 22}
\label{sec:orgbd5a6eb}
\begin{center}
\large \textbf{\uline{Putting it Into Practice}}
\end{center}

\begin{mdframed}
\emph{``But I have only taken this as the first and most evident case of the general
truth: that the great ideals of the past failed not by being outlived (which
must mean over-lived), but by not being lived enough. Mankind has not passed
through the Middle Ages. Rather mankind has retreated from the Middle Ages in
reaction and rout. The Christian ideal has not been tried and found wanting. It
has been found difficult; and left untried.''}

\hfill G.K. Chesterton, \emph{What's Wrong with the World} (1910) \newline

\noindent \emph{``Once again I say: do not be proud. Do not be proud before
those lesser than you, nor before those greater than you. Do not despise those
who spurn you, slander you, revile you, or libel you. Do not despise atheists,
teachers of evil, materialists, or even the wicked, especially the good among
them, because there are many who are good among them even in our time. Remember
them in your prayers as follows: ‘Save, O Lord, those who have no one to pray
for them; also save those who don’t wish to pray to You.’ And add: ‘I am not
praying about them from my pride, Lord, for I myself am vile and worse than
everyone and everything.’ Love God’s common people; do not allow the flock to be
lured away by strangers, for if you fall asleep while in laziness or in your
squeamish pride or, worse, in your covetousness, then they will come from all
sides and lure away your flock. Teach the Gospel to the common people
incessantly\ldots{}.Avoid corruption. Do not come to love gold and silver, do not
hoard them\ldots{}.Believe and raise the banner. Hold it high\ldots{}''}

\hfill Father Zosima in Fyodor Dostoevsky's \emph{The Brothers Karamazov} (1879)
\end{mdframed}
\subsection*{Readings}
\label{sec:org354f247}
\begin{enumerate}
\item \emph{A Christian Field Guide to Technology for Engineers and Designers}, Chapter
9, by Ethan Brue, Derek Schuurman, and Steven Vanderleest
\end{enumerate}
\subsection*{Discussion Topics}
\label{sec:orgfaa8422}
\begin{itemize}
\item How ought a Christian act within the institution?
\item What are some tangible ways to stay rooted in the beatific vision while
employed in a highly technical role?
\item How to not be discouraged and find ``the good among them'', as Father Zosima
(Fyodor Dostoevsky) mentions?
\end{itemize}
\end{document}
